particle-iot/device-os/hal/src/rtl872x/usart_hal.cpp
        UART_RxCmd(uartInstance, DISABLE);
        // Data bits, stop bits and parity
        if ((conf.config & SERIAL_DATA_BITS) == SERIAL_DATA_BITS_8) {
            uartInitStruct.WordLen = RUART_WLS_8BITS;
        } else {
            uartInitStruct.WordLen = RUART_WLS_7BITS;
        }
        if ((conf.config & SERIAL_STOP_BITS) == SERIAL_STOP_BITS_2) {
            uartInitStruct.StopBit = RUART_STOP_BIT_2;
        } else {
            uartInitStruct.StopBit = RUART_STOP_BIT_1;
        }
        switch (conf.config & SERIAL_PARITY) {
            case SERIAL_PARITY_ODD: {
                uartInitStruct.Parity = RUART_PARITY_ENABLE;
                uartInitStruct.ParityType = RUART_ODD_PARITY;
                break;
            }
            case SERIAL_PARITY_EVEN: {
                uartInitStruct.Parity = RUART_PARITY_ENABLE;
                uartInitStruct.ParityType = RUART_EVEN_PARITY;
                break;
            }
            default: { // ParityNone
                uartInitStruct.Parity = RUART_PARITY_DISABLE;
                break;
            }
        }
        uartInstance->LCR = ((uartInitStruct.WordLen) | (uartInitStruct.StopBit << 2) |
                             (uartInitStruct.Parity << 3) | (uartInitStruct.ParityType << 4) | (uartInitStruct.StickParity << 5));
        UART_RxCmd(uartInstance, ENABLE);

        if ((ctsPin_ != PIN_INVALID || rtsPin_ != PIN_INVALID) &&
            ((conf.config & SERIAL_FLOW_CONTROL) != SERIAL_FLOW_CONTROL_NONE)) {
            // Init CTS in low
            PAD_PullCtrl(hal_pin_to_rtl_pin(ctsPin_), GPIO_PuPd_DOWN);
            Pinmux_Config(hal_pin_to_rtl_pin(ctsPin_), PINMUX_FUNCTION_UART_RTSCTS);
            Pinmux_Config(hal_pin_to_rtl_pin(rtsPin_), PINMUX_FUNCTION_UART_RTSCTS);
            uartInstance->MCR |= RUART_MCL_FLOW_ENABLE;
        } else {
            uartInstance->MCR &= ~ BIT(5);
        }

        if (!useInterrupt()) {
            // Configuring DMA
            if (!initDmaChannels()) {
                end();
                return SYSTEM_ERROR_INTERNAL;
            }
        }
        InterruptRegister((IRQ_FUN)uartTxRxIntHandler, uartTable_[index_].IrqNum, (uint32_t)this, 5);
        InterruptEn(uartTable_[index_].IrqNum, 5);

        startReceiver();

        config_ = conf;
        state_ = HAL_USART_STATE_ENABLED;
        return SYSTEM_ERROR_NONE;
    }

    int end() {
        CHECK_TRUE(state_ != HAL_USART_STATE_DISABLED, SYSTEM_ERROR_INVALID_STATE);
        CHECK(disable());
        config_ = {};
        rxBuffer_.reset();
        txBuffer_.reset();
        curTxCount_ = 0;
        transmitting_ = false;
        busy_ = false;
        receiving_ = false;
        state_ = HAL_USART_STATE_DISABLED;
        return SYSTEM_ERROR_NONE;
    }

    int suspend() {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        flush();
        // Update current available received data
        dataInFlight(true /* commit */, false /* cancel */, true /* flushFifo */);
        CHECK(disable(false));
        transmitting_ = false;
        busy_ = false;
        receiving_ = 0;
        rxBuffer_.prune();
        txBuffer_.reset();
        curTxCount_ = 0;
        state_ = HAL_USART_STATE_SUSPENDED;
        return SYSTEM_ERROR_NONE;
    }

    int restore() {
        CHECK_TRUE(state_ == HAL_USART_STATE_SUSPENDED, SYSTEM_ERROR_INVALID_STATE);
        return begin(config_);
    }

    ssize_t space() {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        TxLock lk(this);
        return txBuffer_.space();
    }

    ssize_t write(const uint8_t* buffer, size_t size) {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        CHECK_TRUE(buffer, SYSTEM_ERROR_INVALID_ARGUMENT);
        const ssize_t canWrite = CHECK(space());
        const size_t writeSize = std::min((size_t)canWrite, size);
        CHECK_TRUE(writeSize > 0, SYSTEM_ERROR_NO_MEMORY);

        ssize_t r;
        {
            TxLock lk(this);
            r = CHECK(txBuffer_.put(buffer, writeSize));
            startTransmission();
        }
        return r;
    }

    ssize_t flush() {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        if (useInterrupt() && !transmitting_ && curTxCount_ > 0) {
            auto uartInstance = uartTable_[index_].UARTx;
            transmitting_ = true;
            uartIntConfig(uartInstance, RUART_IER_ETBEI, ENABLE);
        }
        while (true) {
            while (transmitting_ || busy_) {
                // FIXME: busy loop
            }
            {
                AtomicBlock atomic(this);
                if ((!isEnabled() || txBuffer_.empty()) && !busy_) {
                    break;
                }
            }
        }
        return 0;
    }

    size_t dataInFlight(bool commit = false, bool cancel = false, bool flushFifo = false) {
        // Must be called under RX lock!
        if (receiving_ && !useInterrupt()) {
            auto uartInstance = uartTable_[index_].UARTx;
            size_t dmaAvailableInBuffer = GDMA_GetDstAddr(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum) - rxDmaInitStruct_.GDMA_DstAddr;
            size_t blockSize = rxDmaInitStruct_.GDMA_BlockSize;
            size_t alreadyCommitted = blockSize - rxBuffer_.acquirePending();
            size_t transferredToDmaFromUart = uartInstance->RX_BYTE_CNT & RUART_RX_READ_BYTE_CNTER;
            SPARK_ASSERT(transferredToDmaFromUart <= blockSize);
            ssize_t toConsume = 0;
            if (hal_interrupt_is_isr()) {
                // This method is called from DMA RX ISR
                toConsume = transferredToDmaFromUart - alreadyCommitted;
                flushDmaRxFiFo(transferredToDmaFromUart);
            } else if (!commit) {
                // Just counting: report everything the DMA has pulled out of the UART RX FIFO,
                // including bytes still residing in the GDMA FIFO and not yet transferred
                // into the buffer
                toConsume = transferredToDmaFromUart - alreadyCommitted;
            } else {
                toConsume = dmaAvailableInBuffer - alreadyCommitted;
                // Try not suspending DMA unless necessary: force the bytes still residing
                // in the GDMA FIFO out into the buffer only when the caller requires all of
                // them (flushFifo, e.g. peek() or suspend() which disables the DMA channel
                // afterwards, losing these bytes) or when there is nothing to commit otherwise
                if (toConsume <= 0 || (flushFifo && (size_t)toConsume < transferredToDmaFromUart - alreadyCommitted)) {
                    if (transferredToDmaFromUart > dmaAvailableInBuffer) {
                        flushDmaRxFiFo(transferredToDmaFromUart);
                    }
                    toConsume = transferredToDmaFromUart - alreadyCommitted;
                }
            }
            if (commit && toConsume > 0) {
                rxBuffer_.acquireCommit(toConsume);
                if (cancel) {
                    // Release the rest of the buffer if any
                    rxBuffer_.acquireCommit(0, rxBuffer_.acquirePending());
                }
                dcacheInvalidateAligned(rxDmaInitStruct_.GDMA_DstAddr + alreadyCommitted, toConsume);
            }
            return toConsume;
        }
        return 0;
    }

    ssize_t data() {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        ssize_t len = 0;
        RxLock lk(this);
        len = CHECK(rxBuffer_.data()) + dataInFlight();
        return len;
    }

