particle-iot/device-os/hal/src/rtl872x/usart_hal.cpp
    ssize_t read(uint8_t* buffer, size_t size) {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        const ssize_t maxRead = CHECK(data());
        ssize_t readSize = std::min((size_t)maxRead, size);
        CHECK_TRUE(readSize > 0, SYSTEM_ERROR_NO_MEMORY);
        RxLock lk(this);
        if (readSize > rxBuffer_.data()) {
            dataInFlight(true /* commit */);
            // Adjust read size, as dataInFlight() might have committed a bit less
            // as not to stop the DMA transfer unnecessarily if there is already
            // data transferred into the buffer.
            readSize = std::min<size_t>(CHECK(rxBuffer_.data()), size);
        }
        ssize_t r = CHECK(rxBuffer_.get(buffer, readSize));
        if (!receiving_) {
            startReceiver();
        }
        return r;
    }

    ssize_t peek(uint8_t* buffer, size_t size) {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        const ssize_t maxRead = CHECK(data());
        ssize_t peekSize = std::min((size_t)maxRead, size);
        CHECK_TRUE(peekSize > 0, SYSTEM_ERROR_NO_MEMORY);
        RxLock lk(this);
        if (peekSize > rxBuffer_.data()) {
            dataInFlight(true /* commit */, false /* cancel */, true /* flushFifo */);
            // Adjust peek size, as dataInFlight() might have committed a bit less
            // as not to stop the DMA transfer unnecessarily if there is already
            // data transferred into the buffer.
            peekSize = std::min<size_t>(CHECK(rxBuffer_.data()), size);
        }
        return rxBuffer_.peek(buffer, peekSize);
    }

    int pollStatus() {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        if (!useInterrupt()) {
            TxLock lk(this);
            uartTxDmaCompleteHandler(this);
        } else {
            AtomicBlock atomic(this); // Do not use TxLock(), otherwise INT status won't be set.
            uartTxRxIntHandler(this);
        }
        return SYSTEM_ERROR_NONE;
    }

    EventGroupHandle_t eventGroup() {
        return evGroup_;
    }

    int enableEvent(HAL_USART_Pvt_Events event) {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        if (useInterrupt()) {
            if (event & HAL_USART_PVT_EVENT_READABLE) {
                if (data() > 0) {
                    xEventGroupSetBits(evGroup_, HAL_USART_PVT_EVENT_READABLE);
                } else {
                    RxLock lk(this);
                    if (!receiving_) {
                        startReceiver();
                    }
                }
            }
            if ((event & HAL_USART_PVT_EVENT_WRITABLE) && space() > 0) {
                xEventGroupSetBits(evGroup_, HAL_USART_PVT_EVENT_WRITABLE);
            }
            return 0;
        }

        auto uartInstance = uartTable_[index_].UARTx;
        if (event & HAL_USART_PVT_EVENT_READABLE) {
            if (data() <= 0) {
                RxLock lk(this);
                uartIntConfig(uartInstance, (RUART_IER_ERBI | RUART_IER_ELSI | RUART_IER_ETOI), ENABLE);
                UART_RXDMACmd(uartInstance, DISABLE);
                if (!receiving_) {
                    startReceiver();
                }
            } else {
                xEventGroupSetBits(evGroup_, HAL_USART_PVT_EVENT_READABLE);
            }
        }

        if (event & HAL_USART_PVT_EVENT_WRITABLE) {
            if (space() <= 0) {
                TxLock lk(this);
                xEventGroupClearBits(evGroup_, HAL_USART_PVT_EVENT_WRITABLE);
                uartIntConfig(uartInstance, RUART_IER_ETBEI, ENABLE);
                // Temporarily disable TX DMA, otherwise, the TX FIFO won't be empty until all data is transferred by DMA.
                UART_TXDMACmd(uartInstance, DISABLE);
                if (!transmitting_) {
                    startTransmission();
                }
            } else {
                xEventGroupSetBits(evGroup_, HAL_USART_PVT_EVENT_WRITABLE);
            }
        }

        return SYSTEM_ERROR_NONE;
    }

    int disableEvent(HAL_USART_Pvt_Events event) {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        if (useInterrupt()) {
            return 0;
        }

        auto uartInstance = uartTable_[index_].UARTx;
        if (event & HAL_USART_PVT_EVENT_READABLE) {
            RxLock lk(this);
            uartIntConfig(uartInstance, (RUART_IER_ERBI | RUART_IER_ELSI | RUART_IER_ETOI), DISABLE);
            UART_RXDMACmd(uartInstance, ENABLE);
            xEventGroupClearBits(evGroup_, HAL_USART_PVT_EVENT_READABLE);
        }

        if (event & HAL_USART_PVT_EVENT_WRITABLE) {
            TxLock lk(this);
            uartIntConfig(uartInstance, RUART_IER_ETBEI, DISABLE);
            UART_TXDMACmd(uartInstance, ENABLE);
            xEventGroupClearBits(evGroup_, HAL_USART_PVT_EVENT_WRITABLE);
        }

        return SYSTEM_ERROR_NONE;
    }

    int waitEvent(uint32_t events, system_tick_t timeout) {
        CHECK(enableEvent((HAL_USART_Pvt_Events)events));

        auto res = xEventGroupWaitBits(evGroup_, events, pdTRUE, pdFALSE, timeout / portTICK_RATE_MS);
        return res;
    }

    static Usart* getInstance(hal_usart_interface_t serial) {
        static Usart Usarts[] = {
            // NOTE: NCP should be last so that Serial1, Serial2, etc.. are contiguous.
#if PLATFORM_ID == PLATFORM_MSOM || PLATFORM_ID == PLATFORM_SULU
            {3, TX,  RX,  CTS, RTS},                  // LP_UART  (Serial1)
            {2, TX1, RX1, PIN_INVALID, PIN_INVALID},  // LOG UART (Serial2)
            {0, TX2, RX2, CTS2, RTS2},                // UART0    (NCP)
#elif PLATFORM_ID == PLATFORM_TRACKERM
            {2, TX,  RX,  PIN_INVALID, PIN_INVALID},  // LOG UART (Serial1)
            {3, TX1, RX1, CTS1, RTS1},                // LP_UART  (Serial2)
            {0, TX2, RX2, CTS2, RTS2},                // UART0    (NCP)
#elif PLATFORM_ID == PLATFORM_P2
            // NOTE: P2 was already released, so existing mapping will stay the same
            {2, TX,  RX,  PIN_INVALID, PIN_INVALID},  // LOG UART (Serial1)
            {0, TX1, RX1, CTS1, RTS1},                // UART0    (Serial2)
            {3, TX2, RX2, CTS2, RTS2},                // LP_UART  (Serial3)
#else
# error "Platform unsupported"
#endif // PLATFORM_ID == PLATFORM_MSOM
        };
        CHECK_TRUE(serial < sizeof(Usarts) / sizeof(Usarts[0]), nullptr);
        return &Usarts[serial];
    }

