particle-iot/device-os/hal/src/rtl872x/usart_hal.cpp
            // Request a DMA transfer for every received byte (GDMA_SrcMsize is MsizeOne anyway).
            // With a larger burst threshold the tail bytes of a transmission stay in the UART RX FIFO
            // until the RX idle timeout fires, and there is no FIFO level register to account
            // for them in data()/available()
            UART_RXDMAConfig(uartInstance, 1);
            UART_RXDMACmd(uartInstance, ENABLE);

            // Configure GDMA as the flow controller
            uartInstance->MISCR &= ~(RUART_RXDMA_OWNER);
            rxDmaInitStruct_.GDMA_BlockSize = rxSize;
            rxDmaInitStruct_.GDMA_DstAddr = (uint32_t)(ptr);
            // Disable just in case, some of the settings are not applied if already enabled
            GDMA_Cmd(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, DISABLE);
            GDMA_Init(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, &rxDmaInitStruct_);
            GDMA_BurstEnable(rxDmaInitStruct_.GDMA_ChNum, DISABLE);
            // Clear UART RX FIFO read counter
            uartInstance->RX_BYTE_CNT |= RUART_RX_BYTE_CNTER_CLEAR;
            SPARK_ASSERT((uartInstance->RX_BYTE_CNT & RUART_RX_READ_BYTE_CNTER) == 0);
            GDMA_Cmd(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, ENABLE);
        } else {
            uint8_t temp[MAX_UART_FIFO_SIZE];
            if (config_.config & SERIAL_FLOW_CONTROL_RTS) {
                const ssize_t space = rxBuffer_.space();
                if (space > 0) {
                    uint32_t inFifo = UART_ReceiveDataTO(uartInstance, temp, std::min((size_t)space, MAX_UART_FIFO_SIZE), 1);
                    rxBuffer_.put(temp, inFifo);
                }
            } else {
                uint32_t inFifo = UART_ReceiveDataTO(uartInstance, temp, MAX_UART_FIFO_SIZE, 1);
                const ssize_t canWrite = rxBuffer_.space();
                if (canWrite > 0) {
                    rxBuffer_.put(temp, std::min((uint32_t)canWrite, inFifo));
                }
            }
            uartIntConfig(uartInstance, RUART_IER_ERBI | RUART_IER_ELSI | RUART_IER_ETOI, ENABLE);
        }
    }

    static uint32_t uartTxDmaCompleteHandler(void* data) {
        auto uart = (Usart*)data;
        SPARK_ASSERT(!uart->useInterrupt());
        if (!uart->transmitting_) {
            return 0;
        }
        if (GDMA_BASE->STATUS_TFR != 0x00000000 || GDMA_BASE->STATUS_BLOCK != 0x00000000 || GDMA_BASE->STATUS_ERR != 0x00000000) {
            uart->transmitting_ = false;
            auto txDmaInitStruct = &uart->txDmaInitStruct_;
            // Clean Auto Reload Bit
            GDMA_ChCleanAutoReload(txDmaInitStruct->GDMA_Index, txDmaInitStruct->GDMA_ChNum, CLEAN_RELOAD_DST);
            // Clear Pending ISR
            GDMA_ClearINT(txDmaInitStruct->GDMA_Index, txDmaInitStruct->GDMA_ChNum);
            GDMA_Cmd(txDmaInitStruct->GDMA_Index, txDmaInitStruct->GDMA_ChNum, DISABLE);
            uart->txBuffer_.consumeCommit(uart->curTxCount_);
            uart->startTransmission();
        }
        return 0;
    }

    static uint32_t uartRxDmaCompleteHandler(void* data) {
        auto uart = (Usart*)data;
        SPARK_ASSERT(!uart->useInterrupt());
        if (!uart->receiving_) {
            return 0;
        }
        auto rxDmaInitStruct = &uart->rxDmaInitStruct_;
        UART_RXDMACmd(uartTable_[uart->index_].UARTx, DISABLE);
        // Operations to DMA before it is disabled
        uart->dataInFlight(true /* commit */, true /* cancel */);
        // Clean Auto Reload Bit
        GDMA_ChCleanAutoReload(rxDmaInitStruct->GDMA_Index, rxDmaInitStruct->GDMA_ChNum, CLEAN_RELOAD_SRC);
        GDMA_Cmd(rxDmaInitStruct->GDMA_Index, rxDmaInitStruct->GDMA_ChNum, DISABLE);
        // Clear Pending ISR
        GDMA_ClearINT(rxDmaInitStruct->GDMA_Index, rxDmaInitStruct->GDMA_ChNum);
        uart->receiving_ = false;
        uart->startReceiver();
        return 0;
    }

    void uartIntConfig(UART_TypeDef* u, uint32_t mask, uint32_t newState) {
        int st = HAL_disable_irq();
        uint32_t v = (newState == ENABLE) ? (ierShadow_ | mask) : (ierShadow_ & ~mask);
        if (v != ierShadow_) {
            ierShadow_ = v;
            u->DLH_INTCR = v;
        }
        HAL_enable_irq(st);
    }

    IRQn_Type uartIrq() const {
        return uartTable_[index_].IrqNum;
    }

    void lockIrq(IRQn_Type irq, volatile uint32_t& counter) {
        particle::AtomicSection atomic;
        if (counter++ == 0) {
            NVIC_DisableIRQ(irq);
        }
    }

    void unlockIrq(IRQn_Type irq, volatile uint32_t& counter) {
        particle::AtomicSection atomic;
        if (counter > 0 && --counter == 0) {
            NVIC_EnableIRQ(irq);
        }
    }

    void rxLock() {
        if (!useInterrupt()) {
            if (rxDmaInitStruct_.GDMA_ChNum != 0xFF) {
                lockIrq(GDMA_GetIrqNum(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum), irqLockCounter_);
            }
        } else {
            lockIrq(uartIrq(), irqLockCounter_);
        }
    }

    void rxUnlock() {
        if (!useInterrupt()) {
            if (rxDmaInitStruct_.GDMA_ChNum != 0xFF) {
                unlockIrq(GDMA_GetIrqNum(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum), irqLockCounter_);
            }
        } else {
            unlockIrq(uartIrq(), irqLockCounter_);
        }
    }

    void txLock() {
        if (!useInterrupt()) {
            if (txDmaInitStruct_.GDMA_ChNum != 0xFF) {
                lockIrq(GDMA_GetIrqNum(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum), txDmaIrqLockCounter_);
            }
        } else {
            lockIrq(uartIrq(), irqLockCounter_);
        }
    }

    void txUnlock() {
        if (!useInterrupt()) {
            if (txDmaInitStruct_.GDMA_ChNum != 0xFF) {
                unlockIrq(GDMA_GetIrqNum(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum), txDmaIrqLockCounter_);
            }
        } else {
            unlockIrq(uartIrq(), irqLockCounter_);
        }
    }


